app/controllers/admin/admin_users_controller.rb

INSERT INTO `admin_users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `is_admin`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('CK0tNJevAr5QDf9nc', '2010-10-07 08:41:15', '2010-10-07 08:41:15', '2aaf260396d8323fbbdfcb7e0344b3bd42acff18a2d1e409ba3f519d463633e7a281e3be2d66911a3cb6d2abe62f8f37d771a0a797d42c1ad3cf9a6141c756de', 'IR7doQoYcLUyzW1C8af4', '2010-10-07 08:41:15', 0, '127.0.0.1', 'V2Uush4mPJTIoGUoM6', '2010-10-07 08:41:15', NULL, '4f68ed76eb7d9e7ffd9c2f995c7494a888e04d64d7b7a2fd51ecd07f90d513aedc6fc4af4b09914fa6a868442ed78df6cce1b7508a89580d9f5031ddde2ea4da', 1, NULL, 'admin', NULL, 'admin@fourthmedia.co.uk')
---
  def create
    @admin_user = AdminUser.new(params[:admin_user])

    if @admin_user.save