app/controllers/admin/dashboards_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM `orders` WHERE (`orders`.calendar_id = 1) LIMIT 1

  def create
    @dashboard = Dashboard.new(params[:dashboard])
    @global_images = Image.global

    if @dashboard.save
      5.times do |i|
          next if !params[:images] || params[:images][:"attachment_#{i}"].blank?
          image = Image.create!(:attachment => params[:images][:"attachment_#{i}"], :is_admin => true)
---
INSERT INTO `dashboards` (`created_at`, `updated_at`) VALUES('2010-10-11 06:14:50', '2010-10-11 06:14:50')
INSERT INTO `images` (`attachment_file_name`, `attachment_content_type`, `attachment_file_size`, `boolean`, `created_at`, `updated_at`, `page_id`, `is_admin`, `attachment_updated_at`) VALUES('Buster--63-.jpg', 'image/jpeg', 290047, 0, '2010-10-11 06:14:52', '2010-10-11 06:14:52', NULL, 1, '2010-10-11 06:14:50')

  def details
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 5)

  def edit
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)

   def update
     @order = Order.find(params[:id])
     @address = @order.address
     if @order.update_attributes(params[:order]) && @address.update_attributes(params[:address])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
UPDATE `addresses` SET `shipping_address` = 'fgfgffg', `updated_at` = '2010-10-13 05:05:12', `billing_state` = 'Ahmedabad', `shipping_state` = 'Ahmedabad', `billing_country` = 'United State', `shipping_pincode` = 3232, `shipping_city` = 'Ahmedabad', `shipping_country` = 'United State' WHERE `id` = 1
UPDATE `orders` SET `updated_at` = '2010-10-11 05:34:35', `status` = 'Shipped' WHERE `id` = 1

   def update_status
     @order = Order.find(params[:id])
     @address = @order.address
     if @order.update_attributes(params[:order])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
UPDATE `orders` SET `updated_at` = '2010-10-12 06:47:53', `status` = 'Shipped' WHERE `id` = 1

   def admin_calendar
    @order = Order.find(params[:id])
    @calendar = @order.calendar
    @date = params[:month] ? Date.parse(params[:month]) : Date.today.next_year.beginning_of_year
    @image = @calendar.calendar_images.find_by_page_id(@date.month)
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
SELECT * FROM `calendar_images` WHERE (`calendar_images`.`page_id` = 1) AND (`calendar_images`.calendar_id = 1) LIMIT 1

    def images
      @order = Order.find(params[:id])
      @calendar = @order.calendar
      @images = CalendarImage.find_by_calendar_id(@calendar.id)
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)
SELECT * FROM `calendar_images` WHERE (`calendar_images`.`calendar_id` = 1) LIMIT 1

    def update_shipping
      @shipping = Shipping.find(params[:id])
      if @shipping.update_attributes(params[:shipping])
---
SELECT * FROM `shippings` WHERE (`shippings`.`id` = 1)
UPDATE `shippings` SET `updated_at` = '2010-10-12 08:56:03', `price` = 11.0 WHERE `id` = 1

    def update_password
      @admin_user = current_admin
      @shipping = Shipping.find(:first)

      @admin_user.password = params[:admin_user][:password]
      @admin_user.password_confirmation = params[:admin_user][:password_confirmation]
#      if !@admin_user.password.eql?("") && !@admin_user.password_confirmation.eql?("")
      if @admin_user.save
---
UPDATE `admin_users` SET `updated_at` = '2010-10-12 09:10:42', `crypted_password` = '6b832f37be38cd60ca7b5fb58a8cc48b19d2642e318c882fb05e4345d6d36c2b5f5bcc5d6b5ac81e5838ea82baefe46bd90aa32ae86be8093c09d79f1d590441', `perishable_token` = 'OVyjqTneCTccVbX5bSH8', `last_login_at` = '2010-10-12 08:49:36', `last_login_ip` = '127.0.0.1', `current_login_at` = '2010-10-12 09:10:42', `password_salt` = 'L08mmd4iOTMBkHsaGrZ3', `login_count` = 2, `persistence_token` = '64ed98914fb93b3b701751e7f57724f0e5ee81df678c65a721c75ac6e66e68253038779f89ab3934c0a5e03f84fb6af5523231796f570af2948e9ca55e827060', `last_request_at` = '2010-10-12 09:10:42' WHERE `id` = 1