app/controllers/calendars_controller.rb

INSERT INTO `calendars` (`created_at`, `style_id`, `updated_at`, `layout_id`) VALUES('2010-10-07 09:36:01', 1, '2010-10-07 09:36:01', 1)
INSERT INTO `calendar_images` (`image_id`, `created_at`, `updated_at`, `page_id`, `calendar_id`) VALUES(1, '2010-10-07 12:18:42', '2010-10-07 12:18:42', 1, 4)
INSERT INTO `images` (`attachment_file_name`, `attachment_content_type`, `attachment_file_size`, `boolean`, `created_at`, `updated_at`, `page_id`, `is_admin`, `attachment_updated_at`) VALUES(NULL, NULL, NULL, 0, '2010-10-07 12:18:42', '2010-10-07 12:18:42', NULL, 0, NULL)
---
  def create
    @calendar = Calendar.new(params[:calendar])
    @global_images  = Image.global

    @calendar.transaction do
      if @calendar.save!
          12.times do |i|
            next if params["global_image_#{i+1}"].blank?
              @calendar.calendar_images.create!(:image_id => params["global_image_#{i+1}"].to_i, :page_id => i+1)