app/controllers/orders_controller.rb

  def show
    @calendar = Calendar.find(params[:calendar_id])
    @order = @calendar.order
---
SELECT * FROM `calendars` WHERE (`calendars`.`id` = 1)
SELECT * FROM `orders` WHERE (`orders`.calendar_id = 1) LIMIT 1

  def new
    @calendar = Calendar.find(params[:calendar_id])
---
SELECT * FROM `calendars` WHERE (`calendars`.`id` = 1)

 def create
    @calendar = Calendar.find(params[:calendar_id])
    @order = @calendar.build_order(params[:order])
    @order.ip_address = request.remote_ip
    @address  = @order.build_address(params[:address])
    # Old Code
#    if @order.save
#      if @order.purchase
#        session[:quantity] = nil
#        session[:total_price] = nil
#        flash[:notice] = "Thank You!"
#        redirect_to calendar_order_url(@order)
#      else
#        render :action => "failure"
#      end
#    else
#      render :action => :new
#    end
# End
  if [@order, @address].all?(&:valid?)
    @order.transaction do
      if @order.save
---
SELECT * FROM `calendars` WHERE (`calendars`.`id` = 1)
SELECT * FROM `orders` WHERE (`orders`.calendar_id = 1) LIMIT 1
INSERT INTO `addresses` (`shipping_state`, `created_at`, `order_id`, `updated_at`, `billing_city`, `billing_state`, `shipping_address`, `shipping_country`, `billing_address`, `billing_country`, `shipping_city`, `shipping_pincode`, `billing_pincode`) VALUES(NULL, '2010-10-08 08:41:55', 6, '2010-10-08 08:41:55', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
INSERT INTO `orders` (`created_at`, `quantity`, `card_type`, `total_price`, `updated_at`, `lname`, `purchased_at`, `card_expires_on`, `calendar_id`, `fname`, `status`, `email`, `ip_address`) VALUES('2010-10-07 11:01:46', 1, 'visa', 10.0, '2010-10-07 11:01:46', 'dave', NULL, '2010-12-01', 1, 'kalpesh', 'Pending', 'kdave@fourthmedia.co.uk', '127.0.0.1')
UPDATE `orders` SET `updated_at` = '2010-10-07 11:08:49', `purchased_at` = '2010-10-07 16:38:49' WHERE `id` = 5

 def cart
    @calendar = Calendar.find(params[:calendar_id])
---
SELECT * FROM `calendars` WHERE (`calendars`.`id` = 3)

 def calendar
     @calendar = Calendar.find_by_id(params[:calendar_id])
     @date = params[:month] ? Date.parse(params[:month]) : Date.today.next_year.beginning_of_year
     @image = @calendar.calendar_images.find_by_page_id(@date.month)
---
SELECT * FROM `calendars` WHERE (`calendars`.`id` IS NULL) LIMIT 1
SELECT * FROM `calendar_images` WHERE (`calendar_images`.`page_id` = 1) AND (`calendar_images`.calendar_id = 3) LIMIT 1

 def images
   @calendar = Calendar.find(params[:calendar_id])
   @images = CalendarImage.find_by_calendar_id(@calendar.id)
---
SELECT * FROM `calendars` WHERE (`calendars`.`id` = 1)
SELECT * FROM `calendar_images` WHERE (`calendar_images`.`calendar_id` = 1) LIMIT 1